In [3]:
import numpy as np
import pandas as pd

In [4]:
data=pd.read_csv("twtdwt.csv")

In [8]:
data

     company  Male  Female  Total
0    Barclay    10       4     14
1   Symantec     1       1      2
2    Veritas    12       6     18
3  Principal     4       2      6
4       Josh     3       0      3
5     Cybage     3       3      6

get total Employee

In [6]:
data['Total']=data['Male']+data['Female']

In [9]:
data

     company  Male  Female  Total
0    Barclay    10       4     14
1   Symantec     1       1      2
2    Veritas    12       6     18
3  Principal     4       2      6
4       Josh     3       0      3
5     Cybage     3       3      6

# t-weight

In [10]:
data['Male_t-weight']=data['Male']/data['Total']
data['Female_t-weight']=data['Female']/data['Total']

In [11]:
data

     company  Male  Female  Total  Male_t-weight  Female_t-weight
0    Barclay    10       4     14       0.714286         0.285714
1   Symantec     1       1      2       0.500000         0.500000
2    Veritas    12       6     18       0.666667         0.333333
3  Principal     4       2      6       0.666667         0.333333
4       Josh     3       0      3       1.000000         0.000000
5     Cybage     3       3      6       0.500000         0.500000

# d-weight

In [12]:
data['Male_d-weight']=data['Male']/sum(data['Total'])
data['Female_d-weight']=data['Female']/sum(data['Total'])

In [13]:
data

,company,Male,Female,Total,Male_t-weight,Female_t-weight,Male_d-weight,Female_d-weight
0,Barclay,10,4,14,0.714286,0.285714,0.204082,0.081633
1,Symantec,1,1,2,0.500000,0.500000,0.020408,0.020408
2,Veritas,12,6,18,0.666667,0.333333,0.244898,0.122449
3,Principal,4,2,6,0.666667,0.333333,0.081633,0.040816
4,Josh,3,0,3,1.000000,0.000000,0.061224,0.000000
5,Cybage,3,3,6,0.500000,0.500000,0.061224,0.061224